Тест_ЗУП_31_КОРП/src/InformationRegisters/КомментарииКандидатов/КомментарииКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестоПубликации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/КомментарииКандидатов/Forms/КомментарийКандидата/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СохранятьИзменения;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	Если ОбщегоНазначения.СсылкаСуществует(Запись.Пользователь) Тогда
		Заголовок = Строка(Запись.Пользователь);
	КонецЕсли;
	
	Если Запись.Пользователь <> ПользователиКлиентСервер.АвторизованныйПользователь() Тогда
		ТолькоПросмотр = Истина;
		Элементы.Скрытый.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.МестоПубликации) Тогда
		Элементы.ИнформационнаяНадписьМестоПубликации.Видимость = Ложь;
	Иначе
		ТолькоПросмотр = Истина;
		Элементы.ИнформационнаяНадписьМестоПубликации.Видимость = Истина;
		Элементы.ИнформационнаяНадписьМестоПубликации.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Добавлен на сайте %1'"), 
			Запись.МестоПубликации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СохранятьИзменения = Истина Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.Комментарий) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Комментарий не заполнен.'"), , , "Запись.Комментарий", Отказ);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Запись");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранятьИзменения = Истина;
	
	Закрыть(Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
